#lang racket
; Лавріненко В.В.
; ІПЗ-42
; Л.р. 2, завдання 14.2

; процедура для обчислення факторіалу
(define (factorial value)
  ; кінцева умова рекурсії - коли задане число є нулем, у випадку чого повертаємо 1
  (if (= value 0)
      1
      ; інакше процедура  викликається рекурсивно, повертаючи добуток поточного числа та факторіала на 1 меншого
      (* value (factorial (- value 1)))
  )
)

; процедура обчислення комбінації з повтореннями, спираючись на реалізацію процедури обчислення факторіалу
; в межах завдання за n сприймаємо кількість елементів, що можуть повторюватись, а саме - види спорту (кількість яких - 3)
(define (c n k)
  (/(factorial (+ n k -1)) (*(factorial k) (factorial (- n 1))))
)

; процедура обчислення кінцевого результату завдання
; згідно з умовою, обчислюється добуток кількості комбінацій з 3 по n (як кількість варіантів розподілу)
; та факторіал n (як кількість варіантів розподілу спортсменів аза місцями)
(define (result n)
  (*(c 3 n) (factorial n))
)

(display "Введіть кількість атлетів:\n")
(define input (read))
;(display  (input "спортсменів можна розподілити між 3 видами спорту "(result input) " кількість атлетів:\n"))
(fprintf (current-output-port)
           "~a спортсменів можна розподілити між 3 видами спорту ~s способами.\n"
           input
           (result input))
